Обработки/Reports/_СправкаОбИнвестиционныхДоходахИДивидендах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_СправкаОбИнвестиционныхДоходахИДивидендах</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_СправкаОбИнвестиционныхДоходахИДивидендах/Ext/ObjectModule.bsl
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, "Справка о выплаченных инвестиционных доходах и дивидендах", "0.10", "", Истина);
		                                                                                             
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");

	Возврат Настройки;

КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	ЭтотОбъект.Подписант = НастройкиОтчета.Подписант.КонтактноеЛицо;
		
	ДокументРезультат	= Новый ТабличныйДокумент;
	Сформировать(ДокументРезультат);		
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
		
КонецПроцедуры

Функция ПолучитьПараметрыШапки()
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	КлиентыДоверительногоУправленияСрезПоследних.Клиент КАК Клиент
	|ПОМЕСТИТЬ _КлиентДоверительногоУправления
	|ИЗ
	|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК КлиентыДоверительногоУправленияСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследнихРус.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставуРус,
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследнихРус.ЮридическийАдрес КАК ЮридическийАдресРус,
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследнихАнгл.ПолноеНаименованиеПоУставу КАК ПолноеНаименованиеПоУставуАнгл,
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследнихАнгл.ЮридическийАдрес КАК ЮридическийАдресАнгл,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследнихРус.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследнихРус.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследнихРус.Отчество КАК ФИО_Рус,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследнихАнгл.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследнихАнгл.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследнихАнгл.Отчество КАК ФИО_Англ,
	|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
	|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследнихРус,
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Английский)) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследнихАнгл,
	|	_КлиентДоверительногоУправления КАК _КлиентДоверительногоУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Английский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследнихАнгл
	|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследнихАнгл.ЮрФизЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|				&Период,
	|				Организация = &Организация
	|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыФизическихЛицАнкетныеСрезПоследнихРус
	|		ПО _КлиентДоверительногоУправления.Клиент = РеквизитыФизическихЛицАнкетныеСрезПоследнихРус.ЮрФизЛицо,
	|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
	|ГДЕ
	|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЭтотОбъект.Организация.ЮрФизЛицо);
	
	РезультатЗапрос = Запрос.Выполнить();
	
	Возврат РезультатЗапрос;
		
КонецФункции	

Процедура Сформировать(ДокументРезультат) Экспорт
	
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".Сформировать()";
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,Подписант");
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
			Механизм,
			ПараметрыВыполненияДляСбораСтатистики.Хранилище,
			ПараметрыВыполненияДляСбораСтатистики.Описание);
	
	ДокументРезультат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =  
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	НастройкиУчетаАктивовСрезПоследних.УчетныйАктив КАК УчетныйАктив,
		|	НастройкиУчетаАктивовСрезПоследних.АналитикаДоходов КАК АналитикаДоходов
		|ПОМЕСТИТЬ _Аналитики
		|ИЗ
		|	РегистрСведений.НастройкиУчетаАктивов.СрезПоследних(
		|			&ДатаКонечная,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И ВидУчета = ЗНАЧЕНИЕ(Перечисление.ВидыУчета.НалоговыйУчет)
		|				И УчетныйАктив В (ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ПаиИностранныхЭмитентов), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Паи), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииГосударственныеИМуниципальныеКупон), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ОблигацииКорпоративныеКупон), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.ЕврооблигацииКупон), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.Акции), ЗНАЧЕНИЕ(Справочник.УчетныеАктивы.АкцииИностранныхЭмитентов))) КАК НастройкиУчетаАктивовСрезПоследних
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Обороты.Регистратор КАК Регистратор,
		|	Обороты.Субконто1 КАК ПрочиеДоходыРасходы,
		|	Обороты.Субконто2 КАК ЦенныеБумаги,
		|	Обороты.СуммаОборотКт КАК СуммаРуб,
		|	Обороты.ВалютнаяСуммаКорОборотКт КАК СуммаВал,
		|	ВЫБОР
		|		КОГДА Обороты.ВалютаКор = ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)
		|			ТОГДА &Рубль
		|		ИНАЧЕ Обороты.ВалютаКор
		|	КОНЕЦ КАК Валюта,
		|	ВЫБОР
		|		КОГДА Обороты.Субконто2 ССЫЛКА Справочник.Акции
		|			ТОГДА ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|		КОГДА Обороты.Субконто2 ССЫЛКА Справочник.Облигации
		|			ТОГДА ВЫРАЗИТЬ(Обороты.Субконто2 КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|	КОНЕЦ КАК ЮрЛицо,
		|	НАЧАЛОПЕРИОДА(Обороты.Период, ДЕНЬ) КАК ДатаОперации
		|ПОМЕСТИТЬ _Данные
		|ИЗ
		|	РегистрБухгалтерии.НалоговыйУчет.Обороты(
		|			&ДатаНачальная,
		|			&ДатаКонечная,
		|			Регистратор,
		|			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.ПрочиеДоходы),
		|			,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления = &СчетДоверительногоУправления
		|				И Субконто1 В
		|					(ВЫБРАТЬ
		|						_Аналитики.АналитикаДоходов КАК АналитикаДоходов
		|					ИЗ
		|						_Аналитики КАК _Аналитики),
		|			,
		|			) КАК Обороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.Основание КАК Основание,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствам.Сумма
		|			ИНАЧЕ -ЗадолженностиПоДенежнымСредствам.Сумма
		|		КОНЕЦ) КАК Сумма,
		|	СУММА(ВЫБОР
		|			КОГДА ЗадолженностиПоДенежнымСредствам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход)
		|				ТОГДА ЗадолженностиПоДенежнымСредствам.СуммаКупона
		|			ИНАЧЕ -ЗадолженностиПоДенежнымСредствам.СуммаКупона
		|		КОНЕЦ) КАК СуммаКупона,
		|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта
		|ПОМЕСТИТЬ _Задолженность
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.Регистратор В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_Данные.Регистратор КАК Регистратор
		|			ИЗ
		|				_Данные КАК _Данные)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствам.Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.Валюта,
		|	ЗадолженностиПоДенежнымСредствам.Основание
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЗадолженностиПоДенежнымСредствам.Регистратор КАК Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.Валюта КАК Валюта,
		|	ЗадолженностиПоДенежнымСредствам.Сумма КАК Сумма,
		|	ЗадолженностиПоДенежнымСредствам.СуммаКупона КАК СуммаКупона
		|ПОМЕСТИТЬ _ЗадолженностьПоВозврату
		|ИЗ
		|	РегистрНакопления.ЗадолженностиПоДенежнымСредствам КАК ЗадолженностиПоДенежнымСредствам
		|ГДЕ
		|	ЗадолженностиПоДенежнымСредствам.Организация = &Организация
		|	И ЗадолженностиПоДенежнымСредствам.СчетДоверительногоУправления = &СчетДоверительногоУправления
		|	И ЗадолженностиПоДенежнымСредствам.ВидЗадолженности = ЗНАЧЕНИЕ(Справочник.ВидыЗадолженности.ПоВозвратуКупонногоДохода)
		|	И ЗадолженностиПоДенежнымСредствам.Регистратор В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				_Задолженность.Основание КАК Основание
		|			ИЗ
		|				_Задолженность КАК _Задолженность)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗадолженностиПоДенежнымСредствам.Регистратор,
		|	ЗадолженностиПоДенежнымСредствам.Валюта,
		|	ЗадолженностиПоДенежнымСредствам.Основание,
		|	ЗадолженностиПоДенежнымСредствам.ТипЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.ВидЗадолженности,
		|	ЗадолженностиПоДенежнымСредствам.Сумма,
		|	ЗадолженностиПоДенежнымСредствам.СуммаКупона
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Данные.ДатаОперации КАК ДатаОперации,
		|	ВЫБОР
		|		КОГДА _Данные.ЦенныеБумаги ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Interests/Проценты""
		|		ИНАЧЕ ""Dividends/Дивиденды""
		|	КОНЕЦ КАК ВидТранзакции,
		|	ВЫБОР
		|		КОГДА _Данные.ЦенныеБумаги ССЫЛКА Справочник.Облигации
		|			ТОГДА ""Interests/Проценты""
		|		ИНАЧЕ ""Dividends/Дивиденды""
		|	КОНЕЦ КАК КатегорияДохода,
		|	_Данные.ЦенныеБумаги КАК ЦеннаяБумага,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Акции)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Акции).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Акции).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Акции).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Акции).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Векселя)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Векселя).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Векселя).Номер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Векселя).Номер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Векселя).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.ДепозитарныеРасписки)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).РегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Доли)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Доли).ЮрЛицо.Наименование) + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Доли).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Облигации)
		|			ТОГДА """" + ЕСТЬNULL(РеквизитыЮридическихЛицСрезПоследних.СокращенноеНаименование, ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Облигации).Эмитент.Наименование) + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Облигации).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Облигации).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Паи)
		|			ТОГДА """" + РеквизитыПИФСрезПоследних.КраткоеНаименованиеФонда + "", "" + ВЫБОР
		|					КОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).ГосударственныйРегистрационныйНомер <> """"
		|						ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).ГосударственныйРегистрационныйНомер
		|					ИНАЧЕ ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|				КОНЕЦ + "", "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).ВалютаНоминала.Наименование
		|		КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.ПроизводныеФинансовыеИнструменты)
		|			ТОГДА """" + ЕСТЬNULL(КодыВТорговыхСистемахСрезПоследнихISIN.Код, КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Код)
		|		ИНАЧЕ _Данные.ЦенныеБумаги.Наименование
		|	КОНЕЦ КАК ЦеннаяБумагаНаименование,
		|	ЕСТЬNULL(_Задолженность.Сумма, 0) + ЕСТЬNULL(_Задолженность.СуммаКупона, 0) - ЕСТЬNULL(_ЗадолженностьПоВозврату.Сумма, 0) - ЕСТЬNULL(_ЗадолженностьПоВозврату.СуммаКупона, 0) КАК СуммаДохода,
		|	ВЫБОР
		|		КОГДА _Данные.СуммаВал <> 0
		|			ТОГДА _Данные.СуммаВал
		|		ИНАЧЕ _Данные.СуммаРуб
		|	КОНЕЦ КАК СуммаЗачисленная,
		|	ЕСТЬNULL(_Задолженность.Сумма, 0) + ЕСТЬNULL(_Задолженность.СуммаКупона, 0) - ЕСТЬNULL(_ЗадолженностьПоВозврату.Сумма, 0) - ЕСТЬNULL(_ЗадолженностьПоВозврату.СуммаКупона, 0) - ВЫБОР
		|		КОГДА _Данные.СуммаВал <> 0
		|			ТОГДА _Данные.СуммаВал
		|		ИНАЧЕ _Данные.СуммаРуб
		|	КОНЕЦ КАК СуммаНалога,
		|	_Данные.Валюта КАК Валюта,
		|	ВЫБОР
		|		КОГДА _Данные.ЦенныеБумаги ССЫЛКА Справочник.Паи
		|			ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).СтранаРазмещения.КодАльфа3 + "" / "" + ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).СтранаРазмещения.Наименование
		|		ИНАЧЕ РеквизитыЮридическихЛицСрезПоследних_ЮрЛицо.СтранаРегистрации.КодАльфа3 + "" / "" + РеквизитыЮридическихЛицСрезПоследних_ЮрЛицо.СтранаРегистрации.Наименование
		|	КОНЕЦ КАК СтранаРегистрации
		|ИЗ
		|	_Данные КАК _Данные
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(&ДатаКонечная, Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних_ЮрЛицо
		|		ПО _Данные.ЮрЛицо = РеквизитыЮридическихЛицСрезПоследних_ЮрЛицо.ЮрФизЛицо
		|		ЛЕВОЕ СОЕДИНЕНИЕ _Задолженность КАК _Задолженность
		|			ЛЕВОЕ СОЕДИНЕНИЕ _ЗадолженностьПоВозврату КАК _ЗадолженностьПоВозврату
		|			ПО _Задолженность.Основание = _ЗадолженностьПоВозврату.Регистратор
		|		ПО _Данные.Регистратор = _Задолженность.Регистратор
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&ДатаКонечная,
		|				Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Акции)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Акции).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Векселя)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Векселя).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.ДепозитарныеРасписки)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ДепозитарныеРасписки).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Доли)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Доли).ЮрЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.ИпотечныеСертификатыУчастия)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.ИпотечныеСертификатыУчастия).Эмитент.ЮрФизЛицо
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Облигации)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Облигации).Эмитент.ЮрФизЛицо
		|			КОНЕЦ = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКонечная, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВторговыхСистемах.ISIN)) КАК КодыВТорговыхСистемахСрезПоследнихISIN
		|		ПО _Данные.ЦенныеБумаги = КодыВТорговыхСистемахСрезПоследнихISIN.Объект
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыПИФ.СрезПоследних(&ДатаКонечная, ) КАК РеквизитыПИФСрезПоследних
		|		ПО (ВЫБОР
		|				КОГДА ТИПЗНАЧЕНИЯ(_Данные.ЦенныеБумаги) = ТИП(Справочник.Паи)
		|					ТОГДА ВЫРАЗИТЬ(_Данные.ЦенныеБумаги КАК Справочник.Паи).ПаевойИнвестиционныйФонд = РеквизитыПИФСрезПоследних.ПаевойИнвестиционныйФонд
		|				ИНАЧЕ ЛОЖЬ
		|			КОНЕЦ)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВТорговыхСистемах.СрезПоследних(&ДатаКонечная, ВидКода = ЗНАЧЕНИЕ(Перечисление.ВидыКодовВТорговыхСистемах.КодНаММВБ)) КАК КодыВТорговыхСистемахСрезПоследнихКодНаММВБ
		|		ПО _Данные.ЦенныеБумаги = КодыВТорговыхСистемахСрезПоследнихКодНаММВБ.Объект";
	
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("ДатаНачальная", ЭтотОбъект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонечная", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	
	
	Макет = ПолучитьМакет("Отчет");
	ОбластьЗалоговок = Макет.ПолучитьОбласть("Заголовок");
	ОбластьСтрока = Макет.ПолучитьОбласть("Стр");
	
	//Заголовк
	ДанныеЗаголовка = ПолучитьПараметрыШапки();
	ВыборкаДанные = ДанныеЗаголовка.Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока ВыборкаДанные.Следующий() Цикл 
		
		ЗаполнитьЗначенияСвойств(ОбластьЗалоговок.Параметры, ВыборкаДанные);
		
		ОбластьЗалоговок.Параметры.ДоговорАнгл = ВыборкаДанные.НомерДоговора + " from " + Формат(ВыборкаДанные.ДатаДоговора, "ДФ=dd/MM/yyyy");
		ОбластьЗалоговок.Параметры.ДоговорРус = ВыборкаДанные.НомерДоговора + " от " + Формат(ВыборкаДанные.ДатаДоговора, "ДФ=dd.MM.yyyy");
		
	КонецЦикла;		
	
	ОбластьЗалоговок.Параметры.НачалоПериода = Формат(ЭтотОбъект.Период.ДатаНачала, "ДФ=dd/MM/yyyy");
	ОбластьЗалоговок.Параметры.КонецПериода = Формат(ЭтотОбъект.Период.ДатаОкончания, "ДФ=dd/MM/yyyy");

	ДокументРезультат.Вывести(ОбластьЗалоговок);
	
	//тело отчета
	Выборка = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.Прямой);
	
	Пока Выборка.Следующий() Цикл 
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, Выборка);
		ДокументРезультат.Вывести(ОбластьСтрока);
	КонецЦикла;	
	
	//подписи
	СтруктураКлюча = Новый Структура;
	СтруктураКлюча.Вставить("Подразделение", ПредопределенноеЗначение("Справочник.Подразделения.ГруппаКомпаний"));
	СтруктураКлюча.Вставить("Язык", ПредопределенноеЗначение("Справочник.Языки.Русский"));
	СтруктураКлюча.Вставить("Объект", ЭтотОбъект.Организация);
	СтруктураКлюча.Вставить("КонтактноеЛицо", ЭтотОбъект.Подписант);
	
	СтруктураДанныхКонтактногоЛица = РаботаСОтчетами.ПолучитьДанныеКонтактногоЛицаПоКлючу(СтруктураКлюча);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);		
	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя(), Истина, ОриентацияСтраницы.Ландшафт);
	
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);
	
КонецПроцедуры
